{
    "@context": {
        "schema": "http://schema.org/"
    },
    "@graph": [
        {
            "@id": "http://schema.org/Algorithm",
            "@type": "schema:Thing",
            "schema:name": "Algorithm"
        },
        {
            "@id": "http://schema.org/DeepLearning",
            "@type": "schema:Thing",
            "schema:name": "Deep Learning",
            "schema:description": "Deep learning is the subset of machine learning methods based on artificial neural networks (ANNs) with representation learning. The adjective 'deep' refers to the use of multiple layers in the network. Methods used can be either supervised, semi-supervised or unsupervised."
        },
        {
            "@id": "http://schema.org/ArtificialNeuralNetwork",
            "@type": "schema:Thing",
            "schema:name": "Artificial Neural Network",
            "schema:description": "Artificial neural networks were inspired by information processing and distributed communication nodes in biological systems. ANNs have various differences from biological brains. Specifically, artificial neural networks tend to be static and symbolic, while the biological brain of most living organisms is dynamic (plastic) and analog."
        },
        {
            "@id": "http://schema.org/RepresentationLearning",
            "@type": "schema:Thing",
            "schema:name": "Representation Learning",
            "schema:description": "Representation learning is a type of machine learning that involves learning a representation (or encoding) of the input data, such that it can be used for various tasks, such as classification, clustering, dimensionality reduction, and transfer learning."
        },
        {
            "@id": "http://schema.org/SupervisedLearning",
            "@type": "schema:Thing",
            "schema:name": "Supervised Learning",
            "schema:description": "Supervised learning is a type of machine learning where the model is trained on labeled data, with the goal of making predictions on new, unseen data."
        },
        {
            "@id": "http://schema.org/UnsupervisedLearning",
            "@type": "schema:Thing",
            "schema:name": "Unsupervised Learning",
            "schema:description": "Unsupervised learning is a type of machine learning where the model is trained on unlabeled data, with the goal of discovering patterns or structure in the data."
        },
        {
            "@id": "http://schema.org/SemiSupervisedLearning",
            "@type": "schema:Thing",
            "schema:name": "Semi-Supervised Learning",
            "schema:description": "Semi-supervised learning is a type of machine learning that combines elements of supervised and unsupervised learning, where the model is trained on a limited amount of labeled data and a larger amount of unlabeled data."
        },
        {
            "@id": "http://schema.org/ConvolutionalNeuralNetwork",
            "@type": "schema:Thing",
            "schema:name": "Convolutional Neural Network",
            "schema:description": "Convolutional neural networks are a type of neural network architecture that are particularly well-suited for image and video analysis tasks."
        },
        {
            "@id": "http://schema.org/RecurrentNeuralNetwork",
            "@type": "schema:Thing",
            "schema:name": "Recurrent Neural Network",
            "schema:description": "Recurrent neural networks are a type of neural network architecture that are particularly well-suited for sequential data, such as speech, text, or time series data."
        },
        {
            "@id": "http://schema.org/Transformer",
            "@type": "schema:Thing",
            "schema:name": "Transformer",
            "schema:description": "Transformers are a type of neural network architecture that are particularly well-suited for natural language processing tasks, such as machine translation and language modeling."
        }
    ]
}